{
  "backend/main.mo": "Main actor defining customer, service, AMC, revenue, and reminder types with storage maps, ID counters, access control, and mixins for storage and authorization.",
  "backend/migration.mo": "Migration module providing old/new type definitions and data structures for upgrading AMC payment methods and customer records.",
  "feature_evidence.json": "Feature evidence report listing updated frontend files and components related to restricting payment methods and syncing UI with backend changes.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend component, hook, and page in the application.",
  "frontend/DEPLOYMENT.md": "Deployment checklist covering AMC tab visibility, currency formatting, authentication flow, and build steps.",
  "frontend/index.css": "Tailwind base configuration defining CSS variables for themes, charts, and layout with light and dark mode tokens.",
  "frontend/index.html": "HTML entry point setting up the root container and loading the main React bundle.",
  "frontend/src/App.tsx": "Main app component handling authentication, data loading validation, error boundaries, and rendering the dashboard or login prompt.",
  "frontend/src/components/AddAMCContractDialog.tsx": "Provides a dialog for selecting customers and creating new AMC contracts with validation and submission via mutation.",
  "frontend/src/components/AddAMCServiceEntryDialog.tsx": "Dialog form to add a service entry under an AMC contract, including optional parts and price reduction details.",
  "frontend/src/components/AddCustomerDialog.tsx": "Form dialog to create a new customer with optional AMC contract details and validation before submitting.",
  "frontend/src/components/AddReminderDialog.tsx": "Dialog for creating service reminders linked to a customer, validating inputs and submitting to backend.",
  "frontend/src/components/AddServiceEntryDialog.tsx": "Form dialog to add a regular service entry with service type, payment details, and notes, then submit via mutation.",
  "frontend/src/components/AMCBadge.tsx": "UI badge component displaying AMC type labels with dynamic colors using helper metadata.",
  "frontend/src/components/AMCTab.tsx": "Displays all AMC contracts by fetching customers, flattening their contracts, and rendering them in a table with an option to add new AMC entries.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches rendering errors and shows a fallback UI with reload and back buttons.",
  "frontend/src/components/CustomerDetailDialog.tsx": "Dialog for viewing and editing full customer details, including service history, AMC data, and customer updates.",
  "frontend/src/components/CustomerList.tsx": "Sortable customer table with selection, multi-delete, and basic info display including AMC and service dates.",
  "frontend/src/components/CustomersTab.tsx": "Main customer management view supporting filtering, search, import, deletion, and opening customer dialogs.",
  "frontend/src/components/DashboardOverview.tsx": "Dashboard cards summarizing customer counts, services, reminders, and warranty stats with filter navigation.",
  "frontend/src/components/EditServiceEntryDialog.tsx": "Dialog to edit a service entry’s date, type, payment info, notes, and save updates.",
  "frontend/src/components/Footer.tsx": "Simple footer showing © notice and link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Renders the main header with branding, theme toggle, and authenticated user menu including logout handling.",
  "frontend/src/components/ImportPreviewModal.tsx": "Displays a dialog showing parsed CSV customer data with validity status and allows confirming the import.",
  "frontend/src/components/LoginPrompt.tsx": "Shows a landing page with feature highlights and triggers login via Internet Identity.",
  "frontend/src/components/MarkServiceDoneDialog.tsx": "Modal to mark a reminder’s service as completed and auto‑calculate the next reminder date.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty component file.",
  "frontend/src/components/RemindersTab.tsx": "Lists reminders by filter, supports sending WhatsApp messages, and opens dialogs for adding or completing reminders.",
  "frontend/src/components/RevenueAnalyticsTab.tsx": "Provides revenue analytics with monthly, quarterly, yearly, AMC, customer, and payment method breakdowns.",
  "frontend/src/components/ServicesTab.tsx": "Displays and filters service entries, handles add/edit/delete dialogs, and updates payment status using query hooks.",
  "frontend/src/components/ThemeToggle.tsx": "Button component that toggles between light and dark themes.",
  "frontend/src/components/UserManagementTab.tsx": "Empty placeholder file for future user management UI.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAuth.ts": "Empty placeholder hook for future auth logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login state, identity management, and an authentication context.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for customers, services, reminders, and admin checks using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles with light/dark theme CSS variables and global styles.",
  "frontend/src/lib/amc.ts": "Utility functions mapping AMC types and contract statuses to labels and UI styling info.",
  "frontend/src/lib/fyQuarter.ts": "Defines financial year quarters and helpers to compute current quarter and its months.",
  "frontend/src/lib/phoneNormalization.ts": "Normalizes Indian mobile numbers to E.164 format and converts them to WhatsApp-compatible digit strings.",
  "frontend/src/lib/utils.ts": "Common utilities for class merging, date formatting from nanoseconds, and INR currency formatting.",
  "frontend/src/main.tsx": "Application entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/Dashboard.tsx": "Implements the dashboard page with tab navigation and filter handlers for customers, services, reminders, revenue, and AMC tabs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, layout, animations, and enabling typography, container-query, and animation plugins.",
  "project_state.json": "Project state describing revenue-related updates, limiting payment methods to UPI and Cash and listing related feature requests."
}