{
  "backend/main.mo": "Defines the backend canister with customer, service, AMC contract, AMC service entry, reminder, and revenue-related types, along with storage maps and access control state initialization.",
  "feature_evidence.json": "Lists feature evidence records linking features to source files, components, and tests with confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend components, hooks, and pages for reference.",
  "frontend/DEPLOYMENT.md": "Deployment checklist outlining AMC tab visibility, currency formatting checks, authentication flow validation, and build steps.",
  "frontend/index.css": "Tailwind CSS base file defining theme variables, light/dark mode values, and global styles.",
  "frontend/index.html": "Basic HTML entry point loading the React application root and main script.",
  "frontend/src/App.tsx": "Main React component handling authentication, data loading validation, and conditional rendering of the Dashboard or login prompt.",
  "frontend/src/components/AddAMCContractDialog.tsx": "Dialog for creating a new AMC contract, handling customer selection, validation, and submission via addAMC mutation.",
  "frontend/src/components/AddAMCServiceEntryDialog.tsx": "Dialog to add an AMC service entry with date, notes, optional parts and price reduction, submitting through addAMCServiceEntry.",
  "frontend/src/components/AddCustomerDialog.tsx": "Dialog for adding a new customer with optional AMC details, validating fields and submitting through addCustomer.",
  "frontend/src/components/AddReminderDialog.tsx": "Dialog to schedule a reminder for a customer, selecting customer, date, and description before submitting via addReminder.",
  "frontend/src/components/AddServiceEntryDialog.tsx": "Dialog for adding a regular service entry with service type, payment info, notes, and submission through addServiceEntry.",
  "frontend/src/components/AMCBadge.tsx": "Displays a styled badge representing an AMC contract type using metadata from utility functions.",
  "frontend/src/components/AMCTab.tsx": "Renders a table of all AMC contracts with add-contract dialog support, using customer data and currency/date formatting.",
  "frontend/src/components/CustomerDetailDialog.tsx": "Customer detail view with editing, service history, AMC management, and dialogs to add service or AMC service entries.",
  "frontend/src/components/CustomerList.tsx": "Renders a sortable, selectable customer table with admin multi-delete support and per-row view/delete actions.",
  "frontend/src/components/CustomersTab.tsx": "Manages fetching, filtering, searching, importing, and deleting customers, displaying results via CustomerList and dialogs.",
  "frontend/src/components/DashboardOverview.tsx": "Displays dashboard metric cards for customers, services, and reminders using query data with loading states.",
  "frontend/src/components/EditServiceEntryDialog.tsx": "Provides a form dialog to edit a service entry, handling validation and submitting updates via mutation.",
  "frontend/src/components/Footer.tsx": "Simple footer showing ©2025 and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar with branding, theme toggle, and authenticated user menu with logout.",
  "frontend/src/components/ImportPreviewModal.tsx": "Shows a preview of parsed customer import data, highlighting valid/invalid rows and confirming import.",
  "frontend/src/components/LoginPrompt.tsx": "Displays a login landing page and triggers Internet Identity login with status handling and toast messages.",
  "frontend/src/components/MarkServiceDoneDialog.tsx": "Dialog for marking a service as completed and auto‑calculating the next reminder date based on customer interval.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file.",
  "frontend/src/components/RemindersTab.tsx": "Shows today, upcoming, or all reminders with actions like WhatsApp sending, marking done, and customer details.",
  "frontend/src/components/RevenueAnalyticsTab.tsx": "Displays revenue analytics by month, quarter, year, AMC, customers, and payment methods with selectable filters.",
  "frontend/src/components/ServicesTab.tsx": "Lists service entries with filters, payment updates, creation/editing dialogs, and deletion confirmation.",
  "frontend/src/components/ThemeToggle.tsx": "Button to toggle between light and dark themes using next‑themes.",
  "frontend/src/components/UserManagementTab.tsx": "Empty file.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useAuth.ts": "Empty file.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for admin checks and CRUD operations on customers, services, reminders, and revenue data via an actor.",
  "frontend/src/index.css": "Sets Tailwind CSS base styles, custom CSS variables, and light/dark theme tokens.",
  "frontend/src/lib/amc.ts": "Maps AMC types and contract statuses to display labels and style information.",
  "frontend/src/lib/fyQuarter.ts": "Defines fiscal year quarters and utilities to get the current quarter and its label.",
  "frontend/src/lib/phoneNormalization.ts": "Normalizes Indian phone numbers to E.164 format and extracts WhatsApp-compatible digit-only numbers.",
  "frontend/src/lib/utils.ts": "Provides utility functions for merging class names, formatting dates, and formatting INR currency.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main dashboard with tab navigation for overview, customers, services, reminders, revenue, and AMC.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content paths, theme extensions, color variables, animations, and plugins.",
  "project_state.json": "Project metadata describing schema version, features, and deployment-related project state."
}