{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend: Restrict payment methods to UPI and Cash",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Update Revenue → Payment Methods UI to show only UPI and Cash.",
      "acceptanceCriteria": [
        "Revenue → Payment Methods UI shows only two entries: UPI and Cash.",
        "No Bank Transfer / Online / Cheque / Other labels appear anywhere in the Revenue Payment Methods UI.",
        "The Revenue tab renders without TypeScript errors after the backend type changes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RevenueAnalyticsTab.tsx",
          "operation": "modify",
          "description": "Remove any UI cards/rows/labels and related formatting for Bank Transfer, Online, Cheque, and Other from the Payment Methods tab; ensure only UPI and Cash are rendered and only the supported PaymentMethodBreakdown fields are accessed (upiPayments, cashPayments)."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Remove unsupported payment methods from all other frontend payment-method selectors/displays (including AMC forms) and ensure only UPI/Cash are sent to the backend.",
      "acceptanceCriteria": [
        "No UI dropdown/radio/select in the app offers Bank Transfer, Online, Cheque, or Other.",
        "AMC/payment-method related forms (if present) only allow UPI and Cash.",
        "Frontend builds successfully and can create/update relevant records using only UPI/Cash."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AddCustomerDialog.tsx",
          "operation": "modify",
          "description": "Update the AMC Payment Method selector to offer only UPI and Cash; remove Bank Transfer/Online/Cheque options and update the mapping logic so values sent in amcDetails.paymentMethod align with the backend-generated PaymentMethod type."
        },
        {
          "path": "frontend/src/components/CustomerDetailDialog.tsx",
          "operation": "modify",
          "description": "Update the AMC edit/view section to only display and allow selecting UPI or Cash for AMC payment method; remove any string/variant mappings for Bank Transfer/Online/Cheque/Other and ensure updateCustomer requests submit only supported payment method values."
        },
        {
          "path": "frontend/src/components/ServicesTab.tsx",
          "operation": "modify",
          "description": "Audit and update any payment-method display or selection related to service payment updates so only UPI and Cash can be chosen/shown, and no removed labels are rendered anywhere in the services workflow."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Align React Query hooks and frontend types to the new PaymentMethodBreakdown shape (UPI + Cash only).",
      "acceptanceCriteria": [
        "TypeScript compilation succeeds with updated backend-generated types.",
        "Payment method breakdown queries still load successfully and render correct UPI/Cash totals.",
        "No runtime undefined-access occurs due to removed fields (e.g., bankTransfer, onlinePayments, chequePayments, otherPayments)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the payment-method breakdown query hook(s) (including any period-based breakdown hook) to match the updated backend return type containing only upiPayments and cashPayments; remove any references to removed breakdown fields and ensure query keys/types remain consistent."
        },
        {
          "path": "frontend/src/components/RevenueAnalyticsTab.tsx",
          "operation": "modify",
          "description": "Update consumption of the payment breakdown query result to rely only on upiPayments and cashPayments and remove any access to removed properties to prevent TypeScript and runtime errors."
        }
      ]
    }
  ]
}